#include <stdio.h>
#include "cful.h"
#pragma warning(disable:4996)


int r, g, b;

char* drink[10] = { "콜라", "사이다", "물", "커피", "우유", "쥬스", "차", "코코아" };		// 음료수
int price[10] = { 1500, 1500, 500, 800, 800, 1000, 600, 700 };							// 가격
int amount[10] = { 3, 5, 8, 4, 7, 5, 6, 3 };											// 수량





void welcome() {


	r = 246, g = 234, b = 194;
	SET_FG_COLOR(r, g, b);

	printf(",--. ,--. ,------. ,--. ,--. ,------.  ,--.,--.  ,--. ,----.        ,--., --.,  ,---,   ,-----.,--., --. ,--.,--.  ,--.,------. \n");
	printf("\\  `.\'  / |  .---' | , \'.|  ||  .-.  \\ |  ||  ,\'.|  |\'  .-./       |   `.\'   | /  O  \\ \'  .--./|  \'--\'  ||  ||  ,\'.|  ||  .---\' \n");
	printf(" \\     /  |  `--,  |  |\' \'  ||  |  \\  :|  ||  |\' \'  ||  | .---.    |  |\'.\'|  ||  . - .||  |    |  .--.  ||  ||  |\' \'  ||  `--, \n");
	printf("  \\   /   |  `---. |  | `|  ||  \'--\'  /|  ||  | `|  ||  \'--\'  |    |  |   |  ||  | |  |\'  \'--\'\\|  |  |  ||  ||  | `|  ||  `---. \n");
	printf("   `-\'    `------\' `- - \'`--\'`-------\' `--\'`- - \'`--\' `------\'     `--\'   `- -\'`--\'`--\' `-----\'`--\'  `--\'`--\'`--\'  `--\'`------\' \n\n\n\n");


	r = 252, g = 185, b = 170;
	SET_FG_COLOR(r, g, b);

	printf("                            ,------------------------------. \n");
	printf("                            . ,--------------------------. . \n");
	printf("                            . :  ,--.  ,--.  ,--.  ,--.  : . \n");
	printf("                            : :  |  |  |  |  |  |  |  |  : : \n");
	printf("                            . :  |  |  |  |  |  |  |  |  : . \n");
	printf("                            `------------------------------' \n");
	printf("                            :    [1]   [2]   [3]   [4]     :               [1] : 콜라 \n");
	printf("                            . ,--------------------------. .               [2] : 사이다 \n");
	printf("                            . :  ,--.  ,--.  ,--.  ,--.  : .               [3] : 물 \n");
	printf("                            : :  |  |  |  |  |  |  |  |  : :               [4] : 커피 \n");
	printf("                            . :  |  |  |  |  |  |  |  |  : .               [5] : 우유 \n");
	printf("                            `------------------------------'               [6] : 쥬스 \n");
	printf("                            :    [5]   [6]   [7]   [8]     :               [7] : 차 \n");
	printf("                            `------------------------------'               [8] : 코코아 \n");
	printf("                            :    ,------------.    ,---.   : \n");
	printf("                            :    :            :   . --- .  : \n");
	printf("                            :    `------------'    `---'   : \n");
	printf("                            `------------------------------' \n");
	printf("                                 :  :               :  :     \n");
	printf("                                 `--'               `--'     \n");

}



int main() {

	welcome();


	int n, m, w;


	r = 255, g = 255, b = 181;
	SET_FG_COLOR(r, g, b);
	printf("\n\n\n##자판기  음료를 선택하세요. ");

	r = 162, g = 225, b = 219;
	SET_FG_COLOR(r, g, b);
	printf("\n\n##손님  ");
	scanf("%d", &n);


	for (int i = 1; i < 9; i++) {
		if (n == i) {
			r = 255, g = 255, b = 181;
			SET_FG_COLOR(r, g, b);
			printf("\n\n##자판기  %s는 %d원 입니다. \n\n", drink[i - 1], price[i - 1]);

			printf("##자판기  지불 방식을 선택해주세요. \n\n");
			printf("[1] : 동전 \n");
			printf("[2] : 지폐 \n\n");

			r = 162, g = 225, b = 219;
			SET_FG_COLOR(r, g, b);
			printf("##손님  ");
			scanf("%d", &w);


			r = 255, g = 255, b = 181;
			SET_FG_COLOR(r, g, b);

			switch (w) {
			case 1:
				printf("\n\n##자판기  동전을 넣어주세요. \n\n"); break;
			case 2:
				printf("\n\n##자판기  지폐를 넣어주세요. \n\n"); break;
			}


			r = 162, g = 225, b = 219;
			SET_FG_COLOR(r, g, b);
			printf("##손님  ");
			scanf("%d", &m);


			r = 255, g = 255, b = 181;
			SET_FG_COLOR(r, g, b);

			if (m < price[i - 1]) {
				printf("\n\n##자판기  %d원이 부족합니다. \n", price[i - 1] - m);

				r = 162, g = 225, b = 219;
				SET_FG_COLOR(r, g, b);
				printf("\n\n##손님 ‧º·(˚ ˃̣̣̥⌓˂̣̣̥ )‧º·");
			}

			else if (m == price[i - 1]) {
				printf("\n\n##자판기  결제가 완료되었습니다. \n");

				r = 162, g = 225, b = 219;
				SET_FG_COLOR(r, g, b);
				printf("\n\n##손님  ⸜( •ᴗ• )⸝");
			}

			else {
				printf("\n\n##자판기  거스름돈 %d원을 받으십시오. \n", m - price[i - 1]);

				r = 162, g = 225, b = 219;
				SET_FG_COLOR(r, g, b);
				printf("\n\n##손님  *(*´∀｀*)☆");
			}


			r = 255, g = 255, b = 255;
			SET_FG_COLOR(r, g, b);
		}
	}
	
	return 0;
}